renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_hhubsys.c
/******************************************************************************
 Function Name   : usb_hhub_initial
 Description     : Global memory initialized
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     data1   : Not used.
                 : uint16_t     data2   : Not used.
 Return value    : none
 ******************************************************************************/
static void usb_hhub_initial (usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    uint16_t i;

    /* WAIT_LOOP */
    for (i =0; i< (USB_MAXDEVADDR + 1); i++)
    {
        memset(g_usb_hhub_data[ptr->ip][i], 0, 8);
        g_usb_shhub_down_port[ptr->ip][i] = 0;
        g_usb_shhub_remote[ptr->ip][i] = 0;
        memset((void*)&g_usb_shhub_info_data[ptr->ip][i], 0, sizeof(usb_hub_info_t));
        memset((void*)&g_usb_shhub_data_mess[ptr->ip][i], 0, sizeof(usb_utr_t));
    }

    memset(g_usb_hhub_descriptor[ptr->ip], 0, USB_CONFIGSIZE);
    memset(g_usb_shhub_class_request[ptr->ip], 0, (5*2));
    memset((void*)&g_usb_shhub_ctrl_mess[ptr->ip], 0, sizeof(usb_utr_t));

    g_usb_shhub_spec[ptr->ip] = 0;
    g_usb_shhub_speed[ptr->ip] = 0;
    g_usb_shhub_dev_addr[ptr->ip] = 0;
    g_usb_shhub_number[ptr->ip] = 0;

    g_p_usb_shhub_device_table[ptr->ip] = 0;
    g_p_usb_shhub_config_table[ptr->ip] = 0;
    g_p_usb_shhub_interface_table[ptr->ip] = 0;
}
/******************************************************************************
 End of function usb_hhub_initial
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_pipe_info
 Description     : Set pipe information
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint8_t      *table  : Interface Descriptor
                 : uint16_t     speed   : device speed
                 : uint16_t     length  : Interface Descriptor length
 Return value    : uint16_t             : DONE/ERROR
 ******************************************************************************/
static uint16_t usb_hhub_pipe_info (usb_utr_t *ptr, uint8_t *table, uint16_t speed, uint16_t length)
{
    uint16_t ofdsc;
    uint16_t pipe_no;
    usb_pipe_table_reg_t    ep_tbl;

    /* Check Descriptor */
    if (USB_DT_INTERFACE != table[1])
    {
        /* Configuration Descriptor */
        USB_PRINTF0("### Interface descriptor error (HUB).\n");
        return USB_ERROR;
    }

    /* Check Endpoint Descriptor */
    ofdsc = table[0];
    /* WAIT_LOOP */
    while (ofdsc < (length - table[0]))
    {
        /* Search within Interface */
        switch (table[ofdsc + 1])
        {
            /* Device Descriptor */
            case USB_DT_DEVICE :

                /* Configuration Descriptor */
            case USB_DT_CONFIGURATION :

                /* String Descriptor */
            case USB_DT_STRING :

                /* Interface Descriptor */
            case USB_DT_INTERFACE :
                USB_PRINTF0("### Endpoint Descriptor error(HUB).\n");
                return USB_ERROR;
            break;

                /* Endpoint Descriptor */
            case USB_DT_ENDPOINT :
                /* Interrupt Endpoint */
                if (USB_EP_INT == (table[ofdsc + 3] & USB_EP_TRNSMASK))
                {
                    pipe_no = usb_hstd_make_pipe_reg_info (ptr->ip, USB_DEVICEADDR, USB_HUB, speed, &table[ofdsc], &ep_tbl);
                    if (USB_NULL != pipe_no)
                    {
                        usb_hstd_set_pipe_info (ptr->ip, pipe_no, &ep_tbl);
                        return USB_OK;
                    }
                }
                ofdsc += table[ofdsc];
            break;

                /* Device Qualifier Descriptor */
            case USB_DT_DEVICE_QUALIFIER :

                /* Other Speed Configuration */
            case USB_DT_OTHER_SPEED_CONF :

                /* Interface Power Descriptor */
            case USB_DT_INTERFACE_POWER :
                USB_PRINTF0("### Endpoint Descriptor error(HUB).\n");
                return USB_ERROR;
            break;

                /* Another Descriptor */
            default :
                ofdsc += table[ofdsc];
            break;
        }
    }
    return USB_ERROR;
}
/******************************************************************************
 End of function usb_hhub_pipe_info
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hhub_check_request
 Description     : Class check request
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     result  : Check result value
 Return value    : none
 ******************************************************************************/
static void usb_hhub_check_request (usb_utr_t *ptr, uint16_t result)
{
    usb_mh_t p_blf;
    usb_er_t err;
    usb_clsinfo_t *cp;

    /* Get memory pool blk */
    if (USB_OK == USB_PGET_BLK(USB_HUB_MPL, &p_blf))
    {
        cp = (usb_clsinfo_t*) p_blf;
        cp->msginfo = USB_MSG_CLS_CHECKREQUEST;
        cp->result = result;

        cp->ipp = ptr->ipp;
        cp->ip = ptr->ip;

        /* Send message */
        err = USB_SND_MSG(USB_HUB_MBX, (usb_msg_t* )p_blf);
        if (USB_OK != err)
        {
            /* Send message failure */
            err = USB_REL_BLK(USB_HUB_MPL, (usb_mh_t )p_blf);
            USB_PRINTF0("### CheckRequest function snd_msg error\n");
        }
    }
    else
    {
        /* Get memory block failure */
        USB_PRINTF0("### CheckRequest function pget_blk error\n");
        /* WAIT_LOOP */
        while (1)
        {
            /* Non */
        }
    }

}
/******************************************************************************
 End of function usb_hhub_check_request
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED == 0) */

