renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_hhubsys.c
/******************************************************************************
 Function Name   : usb_hhub_chk_config
 Description     : Configuration Descriptor check
 Arguments       : uint16_t **table          : Pointer to Configuration Descriptor area
                 : uint16_t spec             : HUB specification
 Return value    : uint16_t                  : DONE/ERROR
 ******************************************************************************/
static uint16_t usb_hhub_chk_config (uint16_t **table, uint16_t spec)
{
    uint8_t *descriptor_table;

    descriptor_table = (uint8_t*) (table[1]);

    /* Check interface number */
    switch (spec)
    {
        case USB_FSHUB : /* Full Speed Hub */
            if (USB_HUB_INTNUMFS != descriptor_table[4])
            {
                USB_PRINTF0("### HUB configuration descriptor error !\n");
                return USB_ERROR;
            }
        break;
        case USB_HSHUBS : /* Hi Speed Hub(Multi) */
            if (USB_HUB_INTNUMHSS != descriptor_table[4])
            {
                USB_PRINTF0("### HUB configuration descriptor error !\n");
                return USB_ERROR;
            }
        break;
        case USB_HSHUBM : /* Hi Speed Hub(Single) */
            if (USB_HUB_INTNUMHSM != descriptor_table[4])
            {
                USB_PRINTF0("### HUB configuration descriptor error !\n");
                return USB_ERROR;
            }
        break;
        default :
            return USB_ERROR;
        break;
    }
    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_chk_config
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_chk_interface
 Description     : Interface Descriptor check
 Arguments       : uint16_t **table          : Pointer to Interface Descriptor area
                 : uint16_t spec             : HUB specification
 Return value    : uint16_t                  : DONE/ERROR
 ******************************************************************************/
static uint16_t usb_hhub_chk_interface (uint16_t **table, uint16_t spec)
{
    uint8_t *descriptor_Table;

    descriptor_Table = (uint8_t*) (table[2]);

    /* Check interface class */
    if (USB_IFCLS_HUB != descriptor_Table[5])
    {
        USB_PRINTF0("### HUB interface descriptor error !\n");
        return USB_ERROR;
    }

    /* Check interface number */
    switch (spec)
    {
        case USB_FSHUB : /* Full Speed Hub */
            if ((USB_HUB_INTNUMFS - 1u) != descriptor_Table[2])
            {
                USB_PRINTF0("### HUB interface descriptor error !\n");
                return USB_ERROR;
            }
        break;
        case USB_HSHUBS : /* Hi Speed Hub(Single) */
            if ((USB_HUB_INTNUMHSS - 1u) != descriptor_Table[2])
            {
                USB_PRINTF0("### HUB interface descriptor error !\n");
                return USB_ERROR;
            }
        break;
        case USB_HSHUBM : /* Hi Speed Hub(Multi) */
            if ((USB_HUB_INTNUMHSM - 1u) != descriptor_Table[2])
            {
                USB_PRINTF0("### HUB interface descriptor error !\n");
                return USB_ERROR;
            }
        break;
        default :
            return USB_ERROR;
        break;
    }
    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_chk_interface
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_new_connect
 Description     : new connect
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr     : Hub address
                 : uint16_t portnum     : Down port number
                 : usb_clsinfo_t *mess  : Pointer to usb_clsinfo_t structure
 Return value    : none
 ******************************************************************************/
static void usb_hhub_new_connect (usb_utr_t *ptr, uint16_t hubaddr, uint16_t portnum, usb_clsinfo_t *mess)
{
#if (BSP_CFG_RTOS_USED == 1)
    uint16_t devaddr;
    uint16_t result;

    /* New down port device search */
    devaddr = usb_hhub_get_new_devaddr(ptr);
    if (0 != devaddr)
    {
        USB_PRINTF1(" Hubport connect address%d\n", devaddr);
        g_usb_shhub_info_data[ptr->ip][devaddr].up_addr = hubaddr; /* Up-hubaddr set */
        g_usb_shhub_info_data[ptr->ip][devaddr].up_port_num = portnum; /* Up-hubport set */

        result = usb_hhub_port_attach(hubaddr, portnum, (usb_clsinfo_t *)ptr);
        if (USB_CONFIGURED != result)
        {
            /* Hub Port Reset */
            usb_hhub_port_reset(ptr, hubaddr, portnum, (usb_clsinfo_t *)USB_NULL);

            /* Hub Port Set Feature Request */
            usb_hhub_port_set_feature(ptr, hubaddr, portnum, (uint16_t)USB_HUB_PORT_SUSPEND,
                                        class_trans_result);

            /* Hub Port Detach */
            usb_hhub_port_detach(ptr, hubaddr, portnum);
            g_usb_shhub_info_data[ptr->ip][devaddr].up_addr = 0; /* Up-hubaddr clear */
            g_usb_shhub_info_data[ptr->ip][devaddr].up_port_num = 0; /* Up-hubport clear */
        }
    }
    else
    {
        USB_PRINTF0("### device count over !\n");
    }
#else /* (BSP_CFG_RTOS_USED == 1) */
    uint16_t devaddr;

    hubaddr = g_usb_shhub_hub_addr[ptr->ip];
    portnum = g_usb_shhub_event_port[ptr->ip];

    /* New down port device search */
    devaddr = usb_hhub_get_new_devaddr(ptr);
    if (0 != devaddr)
    {
        USB_PRINTF1(" Hubport connect address%d\n", devaddr);
        g_usb_shhub_info_data[ptr->ip][devaddr].up_addr = hubaddr; /* Up-hubaddr set */
        g_usb_shhub_info_data[ptr->ip][devaddr].up_port_num = portnum; /* Up-hubport set */
        g_usb_shhub_process[ptr->ip] = USB_MSG_HUB_ATTACH;
        usb_hhub_specified_path(mess); /* Next Process Selector */

