renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_hhubsys.c
    }
    else
    {
        USB_PRINTF0("### device count over !\n");
    }
#endif /* (BSP_CFG_RTOS_USED == 1) */
}
/******************************************************************************
 End of function usb_hhub_new_connect
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_port_detach
 Description     : HUB down port disconnect
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t hubaddr     : Hub address
                 : uint16_t portnum     : Down port number
 Return value    : none
 ******************************************************************************/
static void usb_hhub_port_detach (usb_utr_t *ptr, uint16_t hubaddr, uint16_t portnum)
{
    uint16_t md;
    usb_hcdreg_t *driver;

    /* Device number --> DeviceAddress */
    uint16_t devaddr;

    /* HUB down port status */
    g_usb_shhub_down_port[ptr->ip][hubaddr] &= (uint16_t) (~USB_BITSET(portnum));

    /* HUB down port RemoteWakeup */
    g_usb_shhub_remote[ptr->ip][hubaddr] &= (uint16_t) (~USB_BITSET(portnum));

    /* Now down port device search */
    devaddr = usb_hhub_get_cnn_devaddr(ptr, hubaddr, portnum);
    /* WAIT_LOOP */
    for (md = 0; md < g_usb_hstd_device_num[ptr->ip]; md++)
    {
        driver = &g_usb_hstd_device_drv[ptr->ip][md];
        if (devaddr == driver->devaddr)
        {
            (*driver->devdetach)(ptr, driver->devaddr, (uint16_t) USB_NO_ARG);

            /* Root port */
            g_usb_hstd_device_info[ptr->ip][driver->devaddr][0] = USB_NOPORT;

            /* Device state */
            g_usb_hstd_device_info[ptr->ip][driver->devaddr][1] = USB_DETACHED;

            /* Not configured */
            g_usb_hstd_device_info[ptr->ip][driver->devaddr][2] = (uint16_t) 0;

            /* Interface Class : NO class */
            g_usb_hstd_device_info[ptr->ip][driver->devaddr][3] = (uint16_t) USB_IFCLS_NOT;

            /* No connect */
            g_usb_hstd_device_info[ptr->ip][driver->devaddr][4] = (uint16_t) USB_NOCONNECT;

            /* Root port */
            driver->rootport = USB_NOPORT;

            /* Device address */
            driver->devaddr = USB_NODEVICE;

            /* Device state */
            driver->devstate = USB_DETACHED;
        }
    }

    /* Selective detach */
    usb_hhub_selective_detach(ptr, devaddr);
}
/******************************************************************************
 End of function usb_hhub_port_detach
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_selective_detach
 Description     : HUB down port Selective disconnect
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  devadr     : Device address
 Return value    : none
 ******************************************************************************/
static void usb_hhub_selective_detach (usb_utr_t *ptr, uint16_t devaddr)
{
    uint16_t addr, i;

    addr = (uint16_t) (devaddr << USB_DEVADDRBIT);

    /* Check Connection */
    if (USB_NOCONNECT != usb_hstd_get_dev_speed(ptr, addr))
    {
        /* WAIT_LOOP */
        for (i = USB_MIN_PIPE_NO; i <= USB_MAX_PIPE_NO; i++)
        {
            /* Not control transfer */
            if (usb_hstd_get_device_address(ptr, i) == addr)
            {
                /* Agreement device address */
                if (USB_PID_BUF == usb_cstd_get_pid(ptr, i))
                {
                    /* PID=BUF ? */
                    usb_hstd_transfer_end(ptr, i, (uint16_t) USB_DATA_STOP);
                }
                usb_cstd_clr_pipe_cnfg(ptr, i);
            }
        }
        usb_hstd_set_dev_addr(ptr, addr, USB_NOCONNECT);
        usb_hstd_set_hub_port(ptr, addr, USB_NULL, USB_NULL);
        USB_PRINTF1("*** Device address %d clear.\n", devaddr);
    }

    /* Root port */
    g_usb_hstd_device_info[ptr->ip][devaddr][0] = USB_NOPORT;

    /* Device state */
    g_usb_hstd_device_info[ptr->ip][devaddr][1] = USB_DETACHED;

    /* Not configured */
    g_usb_hstd_device_info[ptr->ip][devaddr][2] = (uint16_t) 0;

    /* Interface Class : NO class */
    g_usb_hstd_device_info[ptr->ip][devaddr][3] = (uint16_t) USB_IFCLS_NOT;

    /* No connect */
    g_usb_hstd_device_info[ptr->ip][devaddr][4] = (uint16_t) USB_NOCONNECT;

}
/******************************************************************************
 End of function usb_hhub_selective_detach
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_string_descriptor1
 Description     : Get String descriptor
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t devaddr     : Device address
                 : uint16_t index       : Descriptor index
                 : usb_cb_t complete    : Callback function
 Return value    : uint16_t             : error info
 ******************************************************************************/
uint16_t usb_hhub_get_string_descriptor1 (usb_utr_t *ptr, uint16_t devaddr, uint16_t index, usb_cb_t complete)
{
#if (BSP_CFG_RTOS_USED == 1)
    usb_hstd_get_string_desc(ptr, devaddr, (uint16_t) 0);
#else /* (BSP_CFG_RTOS_USED == 1) */
    usb_hstd_get_string_desc(ptr, devaddr, (uint16_t) 0, complete);
#endif /* (BSP_CFG_RTOS_USED == 1) */

    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_get_string_descriptor1
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hhub_get_string_descriptor2
 Description     : Get String descriptor
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t devaddr     : Device address
                 : uint16_t index       : Descriptor index
                 : usb_cb_t complete    : Callback function
 Return value    : uint16_t             : error info
 ******************************************************************************/
uint16_t usb_hhub_get_string_descriptor2 (usb_utr_t *ptr, uint16_t devaddr, uint16_t index, usb_cb_t complete)
{
#if (BSP_CFG_RTOS_USED == 1)
    usb_hstd_get_string_desc(ptr, devaddr, index);
#else /* (BSP_CFG_RTOS_USED == 1) */
    usb_hstd_get_string_desc(ptr, devaddr, index, complete);
#endif /* (BSP_CFG_RTOS_USED == 1) */
    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_get_string_descriptor2
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hhub_get_string_descriptor1check
 Description     : Get String descriptor Check
 Arguments       : uint16_t errcheck    : errcheck
 Return value    : uint16_t             : error info
 ******************************************************************************/
uint16_t usb_hhub_get_string_descriptor1check (uint16_t errcheck)
{
    if ((usb_er_t) USB_DATA_STALL == errcheck)
    {
        USB_PRINTF0("*** LanguageID  not support !\n");
        return USB_ERROR;
    }
    else if ((usb_er_t) USB_CTRL_END != errcheck)
    {
        USB_PRINTF0("*** LanguageID  not support !\n");
        return USB_ERROR;
    }
    else
    {
        /* Non */
    }

    return USB_OK;
}
/******************************************************************************
 End of function usb_hhub_get_string_descriptor1check
 ******************************************************************************/

